app/views/quizplay/index.html.erb

SELECT "genres".* FROM "genres"
SELECT "subgenres".* FROM "subgenres" WHERE "subgenres"."genre_id" = ?  [["genre_id", 1]]
---
            <table class="table table-hover">
              <% genre.subgenres.each do |subgenre| %>