app/views/leaderboard/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<script type="text/javascript">
  $(document).ready(function(){

      var update = function() {
          var genre = $('#genre :selected').text();
          var subgenre = $('#subgenre :selected').text();
          var ins = $('#table_ins').empty();
          $.ajax({
              url: '/leaderboard/update',
              type: 'POST',
              beforeSend: function (xhr) {
                  xhr.setRequestHeader('X-CSRF-Token', $('meta[name="csrf-token"]').attr('content'))
              },
              data: {
                  genre: genre,
                  subgenre: subgenre
              },
              success: function (data, event, status, xhr) {
                  for (var i = 0; i < data.length; i++) {
                      ins.append("<tr><td>" + (i + 1).toString() + "</td><td>" + data[i].user + "</td><td>" + data[i].score + "</td></tr>");
                  }
              },