app/controllers/dashboard_controller.rb

UPDATE "users" SET "score" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["score", 10], ["updated_at", "2017-09-19 16:31:26.005660"], ["id", 1]]
---
  def index
    @sum = 0
    current_user.user_quizs.each do |qt|
      @sum =@sum + qt.score
    end
    current_user.score = @sum
    current_user.save