app/controllers/leaderboard_controller.rb

  def getsubgenres
    @genre = Genre.find_by_name(params[:genre])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."name" = ? LIMIT ?  [["name", "sports"], ["LIMIT", 1]]

  def update
    if params[:genre] == "All"
      @rels = UserQuiz.all
      @users = User.all
      @arr = Array.new

      @users.each do |u|
        @rel = @rels.where(:user => u)
        # if @rel.any?
          @hash = Hash.new
          @hash[:user] = u.email
          @sco = 0
          @rel.each do |r|
            @sco = @sco+ r.score
          end
          @hash[:score] = @sco
          @arr.push(@hash)
        # end
      end
      render json: @arr.sort_by! { |hsh| hsh[:score] }.reverse!

    elsif params[:subgenre] == "All"
      @arr = Array.new
      @users = User.all
      @users.each do |u|
        @genre = Genre.find_by_name(params[:genre])
        @subgs = u.subgenres.where(:genre => @genre)
---
SELECT "users".* FROM "users"
SELECT  "genres".* FROM "genres" WHERE "genres"."name" = ? LIMIT ?  [["name", "sports"], ["LIMIT", 1]]
SELECT "subgenres".* FROM "subgenres" INNER JOIN "user_quizzes" ON "subgenres"."id" = "user_quizzes"."subgenre_id" WHERE "user_quizzes"."user_id" = ? AND "subgenres"."genre_id" = 1  [["user_id", 1]]

        @subgs.each do |subg|
          puts u
          @rel = u.user_quizs.where(:subgenre_id => subg.id)
          @rel.each do |r|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]