app/controllers/quizplay_controller.rb

SELECT "genres".* FROM "genres"
SELECT "subgenres".* FROM "subgenres" WHERE "subgenres"."genre_id" = ?  [["genre_id", 1]]
---
 def index
 	if current_user.presentquizid==0
 		@questions = Question.all
 		@genres = Genre.all
 		@subgenres = Subgenre.all

UPDATE "users" SET "presentquizid" = ?, "presentquizqueid" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["presentquizid", 0], ["presentquizqueid", 0], ["updated_at", "2017-09-19 18:33:40.490697"], ["id", 1]]
---
 def continuepost
 	if params[:arr]["contopt"] !="Yes"
 		current_user.presentquizid = 0
 		current_user.presentquizqueid = 0
 		current_user.cqscore = 0
 		current_user.save

SELECT "subgenres"."id" FROM "subgenres" INNER JOIN "user_quizzes" ON "subgenres"."id" = "user_quizzes"."subgenre_id" WHERE "user_quizzes"."user_id" = ?  [["user_id", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."subgenre_id" = ? ORDER BY "questions"."id" ASC LIMIT ?  [["subgenre_id", 1], ["LIMIT", 1]]
SELECT  "subgenres".* FROM "subgenres" WHERE "subgenres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "presentquizid" = ?, "presentquizqueid" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["presentquizid", 1], ["presentquizqueid", 1], ["updated_at", "2017-09-19 12:46:04.761820"], ["id", 1]]
---
def show
	@subarr = current_user.subgenre_ids

	if @subarr.include?(params[:id].to_i)
		redirect_to quizplay_path, notice: 'This quiz has already been taken.'
	elsif !(Subgenre.find(params[:id]).questions.first)
		redirect_to quizplay_path, notice: 'Quiz is empty'
	else
		current_user.presentquizid=params[:id].to_i
		current_user.cqscore = 0
		current_user.presentquizqueid = Subgenre.find(params[:id]).questions.first.id
		current_user.save

SELECT  "subgenres".* FROM "subgenres" WHERE "subgenres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."subgenre_id" = ? AND "questions"."id" = ? LIMIT ?  [["subgenre_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "presentquizqueid" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["presentquizqueid", 2], ["updated_at", "2017-09-19 13:03:02.095790"], ["id", 1]]
---
def ques
	@subgenre = Subgenre.find(params[:id])
	if @subgenre.id == current_user.presentquizid
		@subgenques = @subgenre.questions
		@question = @subgenques.find(params[:ques])
		if @question
			@last = false
			current_user.presentquizqueid = @question.id
			current_user.save

SELECT  "subgenres".* FROM "subgenres" WHERE "subgenres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def next
	@subgenre = Subgenre.find(params[:id])
    @question = Question.find(params[:ques])

UPDATE "users" SET "presentquizqueid" = ?, "cqscore" = ?, "presentquizid" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["presentquizqueid", 0], ["cqscore", 0], ["presentquizid", 0], ["updated_at", "2017-09-19 16:31:25.877372"], ["id", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."subgenre_id" = ? AND (id > '1') ORDER BY "questions"."id" ASC LIMIT ?  [["subgenre_id", 1], ["LIMIT", 1]]
SELECT "subgenres"."id" FROM "subgenres" INNER JOIN "user_quizzes" ON "subgenres"."id" = "user_quizzes"."subgenre_id" WHERE "user_quizzes"."user_id" = ?  [["user_id", 1]]
---
		current_user.cqscore= current_user.cqscore+10
	end
	current_user.presentquizqueid = @question.id
	current_user.save
	@subgenre = Subgenre.find(params[:id])
    @nextquestion = @subgenre.questions.where("id > ?", params[:ques]).first
    if !@nextquestion
    	@subarr = current_user.subgenre_ids
    	if @subarr.include?(params[:id].to_i)